# ExternallyTaggedNonBRep Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedNonBRep Properties
ExternallyTaggedNonBRep Class See Also
---
The ExternallyTaggedNonBRep type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalId | The external Id of the geometry object.  (Inherited from ExternallyTaggedGeometryObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ExternallyTaggedGeometryObject.) |

# See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace